n = 123456
# %09d 表示最小宽度为 9，左边补 0
print("n(09):%09d" % n)
# %+9d 表示最小宽度为 9，带上符号
print("n(+9):%+9d" % n)
f = 140.5
# %-+010f 表示最小宽度为 10，左对齐，带上符号
print("f(-+0):%-+010f" % f)
s = "Hello"
# %-10s 表示最小宽度为 10，左对齐
print("s(-10):%-10s." % s)

print("=========================")

f = 3.141592653
# 不限宽度 小数点后保留 3 位
print("%.5f" % f)
# 最小宽度为 8，小数点后保留 3 位
print("%8.3f" % f)
# 最小宽度为 8，小数点后保留 3 位，左边补 0
print("%08.3f" % f)
# 最小宽度为 8，小数点后保留 3 位，左边补 0，带符号
print("%+08.3f" % f)

print("=========================")

str1 = "Oct: \061\062\063"
str2 = "Hex: \x31\x32\x33\x78\x79\x7A"
print(str1)
print(str2)
